In [8]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [9]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}


df=pd.DataFrame(data)

In [11]:
df["Department"].unique()
df["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

.unique() returns all the unique values as above and then we can use .value_counts to count all the values themselves

In [12]:
df.rename(columns={"Department":"Dept"}, inplace=True)
print(df)

      Name   Age     Dept   Salary
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

What if we want to create a new column about promoted salary then we use dictionery method

In [14]:
df["Promoted Salary"]=df["Salary"]+5000
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0          55000.0
1      Bob  30.0       IT  60000.0          65000.0
2  Charlie  35.0  Finance  70000.0          75000.0
3    David   NaN       IT  62000.0          67000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  50000.0          55000.0

Now to cleanse our data from the null values we do as following:

In [20]:
df.isnull()

    Name    Age   Dept  Salary  Promoted Salary
0  False  False  False   False            False
1  False  False  False   False            False
2  False  False  False   False            False
3  False   True  False   False            False
4  False  False  False    True             True
5  False  False  False   False            False

In [19]:
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

We can use drop() function to get rid of the null values from the dataframe

In [21]:
df.dropna()  #this would remove any rows with any null values but the original data frame would still remain without inplace=true

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0          55000.0
1      Bob  30.0       IT  60000.0          65000.0
2  Charlie  35.0  Finance  70000.0          75000.0
5    Alice  25.0       HR  50000.0          55000.0

dropna takes arguemnet how=any or all where it would drop any row with any one null value but if we have all then we remove only the rows with "all the rows" with null values

In [22]:
df.dropna(how="all")

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0          55000.0
1      Bob  30.0       IT  60000.0          65000.0
2  Charlie  35.0  Finance  70000.0          75000.0
3    David   NaN       IT  62000.0          67000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  50000.0          55000.0

In [23]:
df.dropna(how="any")

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0          55000.0
1      Bob  30.0       IT  60000.0          65000.0
2  Charlie  35.0  Finance  70000.0          75000.0
5    Alice  25.0       HR  50000.0          55000.0

## So how to deal with unclean null values?

1) One way is to get rid of it with dropna
2) by fillung them up with fillna() function with the most repeated values

In [24]:
df.fillna(0) #here we all null values with 0

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0          55000.0
1      Bob  30.0       IT  60000.0          65000.0
2  Charlie  35.0  Finance  70000.0          75000.0
3    David   0.0       IT  62000.0          67000.0
4      Eve  29.0       HR      0.0              0.0
5    Alice  25.0       HR  50000.0          55000.0

However it is very wrong so we fill with mean it self

In [42]:
df["Age"].fillna(df["Age"].mean())#filling null values in the age column with the average age
df

      Name   Age     Dept  Salary  Promoted Salary
0    Alice  25.0       HR     NaN          55000.0
1      Bob  30.0       IT     NaN          65000.0
2  Charlie  35.0  Finance     NaN          75000.0
3    David  28.8       IT     NaN          67000.0
4      Eve  29.0       HR     NaN          65000.0
5    Alice  25.0       HR     NaN          55000.0

In [41]:
#for salary however its better to take meadian rather than 0 or the average
df["Salary"].fillna(df["Salary"].median())
df

c:\Users\Dell\.conda\envs\super\Lib\site-packages\numpy\lib\_nanfunctions_impl.py:1214: RuntimeWarning: Mean of empty slice
  return np.nanmean(a, axis, out=out, keepdims=keepdims)

      Name   Age     Dept  Salary  Promoted Salary
0    Alice  25.0       HR     NaN          55000.0
1      Bob  30.0       IT     NaN          65000.0
2  Charlie  35.0  Finance     NaN          75000.0
3    David  28.8       IT     NaN          67000.0
4      Eve  29.0       HR     NaN          65000.0
5    Alice  25.0       HR     NaN          55000.0

In [40]:
df["Promoted Salary"].fillna(df["Promoted Salary"].median())
df

      Name   Age     Dept  Salary  Promoted Salary
0    Alice  25.0       HR     NaN          55000.0
1      Bob  30.0       IT     NaN          65000.0
2  Charlie  35.0  Finance     NaN          75000.0
3    David  28.8       IT     NaN          67000.0
4      Eve  29.0       HR     NaN          65000.0
5    Alice  25.0       HR     NaN          55000.0

We can use forward fill and backward fill method such that we can use element from either the row prior or the row after the row containing the null values

df["Age"].fillna(method="ffill")<br>
df["Age"].fillna(method="bfill")

## To replace

In [44]:
df["Name"]=df["Name"].replace("Charlie","Higehiro")
df

       Name   Age     Dept  Salary  Promoted Salary
0     Alice  25.0       HR     NaN          55000.0
1       Bob  30.0       IT     NaN          65000.0
2  Higehiro  35.0  Finance     NaN          75000.0
3     David  28.8       IT     NaN          67000.0
4       Eve  29.0       HR     NaN          65000.0
5     Alice  25.0       HR     NaN          55000.0

## HOW TO GET RID OF DUPLICATE VALUES:

If we go through duplicatted methods we go from top to bottom and create a list to check if they are duplicated and go through the list and when we found one duplicate we mark it down

In [48]:
df_dup=df[df.duplicated]
df_dup

    Name   Age Dept  Salary  Promoted Salary
5  Alice  25.0   HR     NaN          55000.0

If we keep="last or first" which will keep either the last or the first value that is duplicated

## HOW TO DEAL WITH INVALID VALUES

We use lamba function to "map" and "apply"<br>Checkout kaggle for better documentation of this

## Mergin data

When we have data in different sheets with the list of values so <br>Joins-left,right,outer and inner join

For left join common data is ignored and only from the data set A is taken and happens same but in different set for right and outer data set we join all of them and inner only common while merging we merge on hte common column of the venn diagram and other exclusive elements of the set

# Concat

pd.concat([df1,df2], axis=1)

pd.merge(df1,df2,on="Department")

## HOW TO IMPORT THE WHOLE DATA SET FROM THE EXCEL OR CSV

data=pd.read_csv(path_location)

data.head() can be performed to check all the columns